Revit 2024 API
SlabShapeVertex.VertexType Property
The type of the vertex.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SlabShapeVertexType VertexType { get; }
Visual Basic
Public ReadOnly Property VertexType As SlabShapeVertexType
	Get
Visual C++
public:
property SlabShapeVertexType VertexType {
	SlabShapeVertexType get ();
}
See Also
SlabShapeVertex Class
Autodesk.Revit.DB Namespace